#+BEGIN_COMMENT
.. title: Graphs: Strongly Connected Components
.. slug: graphs-strongly-connected-components
.. date: 2022-04-20 19:43:49 UTC-07:00
.. tags: graphs,algorithms,data structures
.. category: Data Structures
.. link: 
.. description: Using Depth-First Search to find Strongly Connected Components.
.. type: text
.. has_math: True
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-a1a2f205-43b2-412f-8f21-52a0eff802f5-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
#+begin_src python :tangle ../bowling/data_structures/graphs/transpose.py :exports none
<<imports>>


<<the-transposer>>

    <<the-adjacent>>

    <<the-vertices>>

    <<the-call>>


<<strongly-connected-components>>

    <<the-transpose-property>>

    <<find-child>>

    <<the-forest>>
#+end_src
** Testing it
#+begin_src python :results none
from bowling.data_structures.graphs.transpose import StronglyConnectedComponents

graph = DirectedGraph()
vertex_a = DFSVertex("a")
vertex_b = DFSVertex("b")
vertex_c = DFSVertex("c")
vertex_d = DFSVertex("d")
vertex_e = DFSVertex("e")
vertex_f = DFSVertex("f")
vertex_g = DFSVertex("g")
vertex_h = DFSVertex("h")

graph.add(vertex_a, vertex_b)
graph.add(vertex_b, vertex_c)
graph.add(vertex_b, vertex_e)
graph.add(vertex_b, vertex_f)
graph.add(vertex_c, vertex_d)
graph.add(vertex_c, vertex_g)
graph.add(vertex_d, vertex_c)
graph.add(vertex_d, vertex_h)
graph.add(vertex_e, vertex_a)
graph.add(vertex_e, vertex_f)
graph.add(vertex_f, vertex_g)
graph.add(vertex_g, vertex_f)
graph.add(vertex_g, vertex_h)
graph.add(vertex_h, vertex_h)

components = StronglyConnectedComponents(graph)
forest = components.forest
#+end_src

Let's see what's in the forest.

Since the Depth-First Search created a forest of strongly connected components, we can see how many trees are in the forest by finding the roots (the nodes with no predecessor).

#+begin_src python :results output :exports both
for root in forest:
    print(root)
#+end_src

#+RESULTS:
#+begin_example
abe
cd
fg
h
[autoreload of bowling.data_structures.graphs.transpose failed: Traceback (most recent call last):
  File "/home/bravo/.virtualenvs/Bowling-For-Data/site-packages/IPython/extensions/autoreload.py", line 245, in check
    superreload(m, reload, self.old_objects)
  File "/home/bravo/.virtualenvs/Bowling-For-Data/site-packages/IPython/extensions/autoreload.py", line 394, in superreload
    module = reload(module)
  File "/usr/lib/pypy3/lib-python/3/imp.py", line 314, in reload
    return importlib.reload(module)
  File "/usr/lib/pypy3/lib-python/3/importlib/__init__.py", line 169, in reload
    _bootstrap._exec(spec, module)
  File "<frozen importlib._bootstrap>", line 639, in _exec
  File "<builtin>/frozen importlib._bootstrap_external", line 737, in exec_module
  File "<builtin>/frozen importlib._bootstrap_external", line 873, in get_code
  File "<builtin>/frozen importlib._bootstrap_external", line 804, in source_to_code
  File "<frozen importlib._bootstrap>", line 228, in _call_with_frames_removed
  File "/home/bravo/Bowling-For-Data/bowling/data_structures/graphs/transpose.py", line 126
    self._forest[tuple(tree])] = neighbors
                           ^
SyntaxError: closing parenthesis ']' does not match opening parenthesis '('
]
#+end_example

So We have four Strongly Connected Components.

#+begin_src python :results output :exports both

#+end_src
